Tests/sysbench_results_c6g.2xlarge_20250605_030118.txt
=====================================================================
SYSBENCH COMPREHENSIVE BENCHMARK RESULTS
=====================================================================
Start Time: Thu Jun  5 03:01:18 UTC 2025
Hostname: ip-172-28-34-204.8067.aws-int.thomsonreuters.com
Instance Type: c6g.2xlarge
Operating System: Linux ip-172-28-34-204.8067.aws-int.thomsonreuters.com 6.1.131-143.221.amzn2023.aarch64 #1 SMP Mon Mar 24 15:34:49 UTC 2025 aarch64 aarch64 aarch64 GNU/Linux
CPU Info: Neoverse-N1 AWS Graviton2
CPU Cores: 8
Memory: 15Gi
=====================================================================

[2025-06-05 03:01:18] Starting Sysbench Comprehensive Benchmark Suite
[2025-06-05 03:01:18] Results will be saved to: sysbench_results_c6g.2xlarge_20250605_030118.txt
[2025-06-05 03:01:18] ================================================
[2025-06-05 03:01:18] Checking prerequisites...
[2025-06-05 03:01:18] k6 found - K6 tests will be included
[SUCCESS] Prerequisites check passed
[2025-06-05 03:01:18] Setting up PostgreSQL database and user...
[SUCCESS] PostgreSQL setup completed
[2025-06-05 03:01:19] Starting CPU benchmarks...
[2025-06-05 03:01:19] Detected 8 CPU cores

=====================================================================
SINGLE-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-05 03:01:19] Running single-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 1 eps: 26158.33 lat (ms,95%): 0.04
[ 20s ] thds: 1 eps: 26200.49 lat (ms,95%): 0.04
[ 30s ] thds: 1 eps: 26199.01 lat (ms,95%): 0.04
[ 40s ] thds: 1 eps: 26197.20 lat (ms,95%): 0.04
[ 50s ] thds: 1 eps: 26194.50 lat (ms,95%): 0.04
[ 60s ] thds: 1 eps: 26198.89 lat (ms,95%): 0.04
[ 70s ] thds: 1 eps: 26200.10 lat (ms,95%): 0.04
[ 80s ] thds: 1 eps: 26195.81 lat (ms,95%): 0.04
[ 90s ] thds: 1 eps: 26205.90 lat (ms,95%): 0.04
[ 100s ] thds: 1 eps: 26202.59 lat (ms,95%): 0.04
[ 110s ] thds: 1 eps: 26211.00 lat (ms,95%): 0.04
CPU speed:
    events per second: 26197.91

Throughput:
    events/s (eps):                      26197.9119
    time elapsed:                        120.0002s
    total number of events:              3143754

Latency (ms):
         min:                                    0.04
         avg:                                    0.04
         max:                                    0.17
         95th percentile:                        0.04
         sum:                               119611.80

Threads fairness:
    events (avg/stddev):           3143754.0000/0.00
    execution time (avg/stddev):   119.6118/0.00

[SUCCESS] Single-core CPU benchmark completed

=====================================================================
MULTI-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-05 03:03:19] Running multi-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 8 eps: 207449.96 lat (ms,95%): 0.04
[ 20s ] thds: 8 eps: 207722.06 lat (ms,95%): 0.04
[ 30s ] thds: 8 eps: 207381.25 lat (ms,95%): 0.04
[ 40s ] thds: 8 eps: 207903.91 lat (ms,95%): 0.04
[ 50s ] thds: 8 eps: 207841.79 lat (ms,95%): 0.04
[ 60s ] thds: 8 eps: 207861.38 lat (ms,95%): 0.04
[ 70s ] thds: 8 eps: 207570.49 lat (ms,95%): 0.04
[ 80s ] thds: 8 eps: 207942.95 lat (ms,95%): 0.04
[ 90s ] thds: 8 eps: 207291.16 lat (ms,95%): 0.04
[ 100s ] thds: 8 eps: 207956.24 lat (ms,95%): 0.04
[ 110s ] thds: 8 eps: 207825.11 lat (ms,95%): 0.04
CPU speed:
    events per second: 207726.86

Throughput:
    events/s (eps):                      207726.8610
    time elapsed:                        120.0003s
    total number of events:              24927277

Latency (ms):
         min:                                    0.04
         avg:                                    0.04
         max:                                   24.04
         95th percentile:                        0.04
         sum:                               955682.17

Threads fairness:
    events (avg/stddev):           3115909.6250/16734.12
    execution time (avg/stddev):   119.4603/0.00

[SUCCESS] Multi-core CPU benchmark completed
[2025-06-05 03:05:19] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed
[2025-06-05 03:05:19] Preparing PostgreSQL test data...

=====================================================================
POSTGRESQL DATA PREPARATION
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 1000000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 1000000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 1000000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 1000000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
[SUCCESS] PostgreSQL test data preparation completed
[2025-06-05 03:07:30] Starting PostgreSQL benchmarks...

=====================================================================
READ-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 03:07:30] Running Read-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 5046.62 qps: 80753.86 (r/w/o: 70659.82/0.00/10094.05) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 5011.29 qps: 80178.99 (r/w/o: 70156.41/0.00/10022.59) lat (ms,95%): 1.82 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 5013.50 qps: 80215.38 (r/w/o: 70188.38/0.00/10027.00) lat (ms,95%): 1.79 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 5012.10 qps: 80195.67 (r/w/o: 70171.48/0.00/10024.20) lat (ms,95%): 2.00 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 5197.10 qps: 83152.76 (r/w/o: 72758.65/0.00/10394.11) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 5121.30 qps: 81942.37 (r/w/o: 71699.67/0.00/10242.70) lat (ms,95%): 1.64 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 5181.50 qps: 82902.96 (r/w/o: 72540.07/0.00/10362.90) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 5189.40 qps: 83031.06 (r/w/o: 72652.16/0.00/10378.91) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 5142.20 qps: 82274.18 (r/w/o: 71989.79/0.00/10284.40) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 5186.60 qps: 82986.44 (r/w/o: 72613.23/0.00/10373.20) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 5187.30 qps: 82993.95 (r/w/o: 72619.36/0.00/10374.59) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 5135.50 qps: 82170.32 (r/w/o: 71899.41/0.00/10270.90) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            8599584
        write:                           0
        other:                           1228512
        total:                           9828096
    transactions:                        614256 (5118.70 per sec.)
    queries:                             9828096 (81899.15 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      5118.6971
    time elapsed:                        120.0024s
    total number of events:              614256

Latency (ms):
         min:                                    1.19
         avg:                                    1.56
         max:                                   28.51
         95th percentile:                        1.64
         sum:                               959198.57

Threads fairness:
    events (avg/stddev):           76782.0000/498.77
    execution time (avg/stddev):   119.8998/0.00

[SUCCESS] Read-Only benchmark completed

=====================================================================
WRITE-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 03:09:30] Running Write-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 1554.32 qps: 9329.91 (r/w/o: 0.00/6220.47/3109.44) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 896.52 qps: 5379.13 (r/w/o: 0.00/3586.08/1793.04) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 561.90 qps: 3371.40 (r/w/o: 0.00/2247.60/1123.80) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1200.90 qps: 7205.40 (r/w/o: 0.00/4803.60/2401.80) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 473.60 qps: 2841.60 (r/w/o: 0.00/1894.40/947.20) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1300.00 qps: 7800.00 (r/w/o: 0.00/5200.00/2600.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 481.60 qps: 2889.60 (r/w/o: 0.00/1926.40/963.20) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 1261.60 qps: 7568.00 (r/w/o: 0.00/5044.80/2523.20) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 503.60 qps: 3023.20 (r/w/o: 0.00/2016.00/1007.20) lat (ms,95%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 1137.60 qps: 6825.58 (r/w/o: 0.00/4550.39/2275.19) lat (ms,95%): 18.95 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 615.60 qps: 3693.60 (r/w/o: 0.00/2462.40/1231.20) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 868.80 qps: 5212.81 (r/w/o: 0.00/3475.21/1737.60) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           434280
        other:                           217140
        total:                           651420
    transactions:                        108570 (904.71 per sec.)
    queries:                             651420 (5428.26 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      904.7094
    time elapsed:                        120.0054s
    total number of events:              108570

Latency (ms):
         min:                                    1.15
         avg:                                    8.84
         max:                                  169.47
         95th percentile:                       21.50
         sum:                               959849.51

Threads fairness:
    events (avg/stddev):           13571.2500/1.20
    execution time (avg/stddev):   119.9812/0.00

[SUCCESS] Write-Only benchmark completed

=====================================================================
READ-WRITE BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 03:11:30] Running Read-Write benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 347.46 qps: 6964.49 (r/w/o: 4875.70/1393.06/695.73) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 354.30 qps: 7086.02 (r/w/o: 4960.21/1417.20/708.60) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 516.50 qps: 10330.00 (r/w/o: 7231.00/2066.00/1033.00) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 432.30 qps: 8645.30 (r/w/o: 6052.20/1728.50/864.60) lat (ms,95%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 560.40 qps: 11208.70 (r/w/o: 7845.60/2242.30/1120.80) lat (ms,95%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 773.20 qps: 15463.98 (r/w/o: 10824.79/3092.80/1546.40) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 513.80 qps: 10276.01 (r/w/o: 7193.21/2055.20/1027.60) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 705.90 qps: 14117.31 (r/w/o: 9882.30/2823.20/1411.80) lat (ms,95%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 737.10 qps: 14742.70 (r/w/o: 10319.70/2948.80/1474.20) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 449.70 qps: 8993.99 (r/w/o: 6295.79/1798.80/899.40) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 975.50 qps: 19509.90 (r/w/o: 13657.00/3901.90/1951.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 445.00 qps: 8900.10 (r/w/o: 6230.00/1780.10/890.00) lat (ms,95%): 23.10 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            953680
        write:                           272480
        other:                           136240
        total:                           1362400
    transactions:                        68120  (567.33 per sec.)
    queries:                             1362400 (11346.59 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      567.3295
    time elapsed:                        120.0713s
    total number of events:              68120

Latency (ms):
         min:                                    2.40
         avg:                                   14.10
         max:                                  228.84
         95th percentile:                       23.10
         sum:                               960349.73

Threads fairness:
    events (avg/stddev):           8515.0000/47.48
    execution time (avg/stddev):   120.0437/0.00

[SUCCESS] Read-Write benchmark completed

=====================================================================
OLTP POINT SELECT BENCHMARK
=====================================================================

[2025-06-05 03:13:30] Running OLTP Point Select benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            781408
        write:                           0
        other:                           0
        total:                           781408
    transactions:                        781408 (78114.03 per sec.)
    queries:                             781408 (78114.03 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      78114.0349
    time elapsed:                        10.0034s
    total number of events:              781408

Latency (ms):
         min:                                    0.04
         avg:                                    0.10
         max:                                    6.96
         95th percentile:                        0.17
         sum:                                79710.32

Threads fairness:
    events (avg/stddev):           97676.0000/1633.80
    execution time (avg/stddev):   9.9638/0.00

[SUCCESS] OLTP Point Select benchmark completed

=====================================================================
OLTP UPDATE INDEX BENCHMARK
=====================================================================

[2025-06-05 03:13:40] Running OLTP Update Index benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           27688
        other:                           0
        total:                           27688
    transactions:                        27688  (2767.92 per sec.)
    queries:                             27688  (2767.92 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      2767.9171
    time elapsed:                        10.0032s
    total number of events:              27688

Latency (ms):
         min:                                    1.06
         avg:                                    2.89
         max:                                   41.67
         95th percentile:                        3.68
         sum:                                79991.87

Threads fairness:
    events (avg/stddev):           3461.0000/0.00
    execution time (avg/stddev):   9.9990/0.00

[SUCCESS] OLTP Update Index benchmark completed
[2025-06-05 03:13:50] Starting K6 benchmarks...
[2025-06-05 03:13:50] Truncating cache table...
TRUNCATE TABLE
[SUCCESS] Cache table truncated

=====================================================================
K6 AOT INSERT TEST
=====================================================================

[2025-06-05 03:13:50] Running K6 AOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 10220 complete and 0 interrupted iterations
default   [  10% ] 80 VUs  00m01.0s/10m0s  010221/100000 shared iters

running (00m02.0s), 80/80 VUs, 23959 complete and 0 interrupted iterations
default   [  24% ] 80 VUs  00m02.0s/10m0s  023959/100000 shared iters

running (00m03.0s), 80/80 VUs, 37924 complete and 0 interrupted iterations
default   [  38% ] 80 VUs  00m03.0s/10m0s  037924/100000 shared iters

running (00m04.0s), 80/80 VUs, 52056 complete and 0 interrupted iterations
default   [  52% ] 80 VUs  00m04.0s/10m0s  052056/100000 shared iters

running (00m05.0s), 80/80 VUs, 65940 complete and 0 interrupted iterations
default   [  66% ] 80 VUs  00m05.0s/10m0s  065940/100000 shared iters

running (00m06.0s), 80/80 VUs, 79935 complete and 0 interrupted iterations
default   [  80% ] 80 VUs  00m06.0s/10m0s  079935/100000 shared iters

running (00m07.0s), 80/80 VUs, 93928 complete and 0 interrupted iterations
default   [  94% ] 80 VUs  00m07.0s/10m0s  093929/100000 shared iters
time="2025-06-05T03:13:58Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-05T03:13:58Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=9.79ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  13375.832954/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=5.73ms min=399.29µs med=5.17ms max=209.09ms p(90)=8.19ms p(95)=9.79ms
      { endpoint:postgres_insert }..............................................: avg=5.73ms min=399.29µs med=5.17ms max=209.09ms p(90)=8.19ms p(95)=9.79ms
      { expected_response:true }................................................: avg=5.73ms min=399.29µs med=5.17ms max=209.09ms p(90)=8.19ms p(95)=9.79ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 13375.966712/s

    EXECUTION
    iteration_duration..........................................................: avg=5.92ms min=480.45µs med=5.29ms max=210.5ms  p(90)=8.59ms p(95)=10.4ms
    iterations..................................................................: 100000 13375.832954/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.2 MB/s
    data_sent...................................................................: 26 MB  3.5 MB/s



running (00m07.5s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m07.4s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Insert test completed

=====================================================================
K6 AOT QUERY TEST
=====================================================================

[2025-06-05 03:13:58] Running K6 AOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-05T03:13:58Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-05T03:13:58Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-05T03:13:58Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-05T03:13:58Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-05T03:13:58Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-05T03:13:58Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-05T03:13:58Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-05T03:13:58Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-05T03:13:58Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-05T03:13:58Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-05T03:13:58Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-05T03:13:58Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 13464 complete and 0 interrupted iterations
default   [  13% ] 80 VUs  00m00.9s/10m0s  013466/100000 shared iters

running (00m02.0s), 80/80 VUs, 28122 complete and 0 interrupted iterations
default   [  28% ] 80 VUs  00m01.9s/10m0s  028122/100000 shared iters

running (00m03.0s), 80/80 VUs, 42676 complete and 0 interrupted iterations
default   [  43% ] 80 VUs  00m02.9s/10m0s  042677/100000 shared iters

running (00m04.0s), 80/80 VUs, 57493 complete and 0 interrupted iterations
default   [  57% ] 80 VUs  00m03.9s/10m0s  057493/100000 shared iters

running (00m05.0s), 80/80 VUs, 72525 complete and 0 interrupted iterations
default   [  73% ] 80 VUs  00m04.9s/10m0s  072526/100000 shared iters

running (00m06.0s), 80/80 VUs, 87244 complete and 0 interrupted iterations
default   [  87% ] 80 VUs  00m05.9s/10m0s  087246/100000 shared iters
time="2025-06-05T03:14:05Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-05T03:14:05Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=9.05ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  43738.397684/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=5.17ms min=346.58µs med=4.77ms max=23.64ms p(90)=7.7ms  p(95)=9.05ms
      { endpoint:postgres_get }.............................................: avg=5.18ms min=346.58µs med=4.77ms max=23.64ms p(90)=7.7ms  p(95)=9.05ms
      { expected_response:true }............................................: avg=5.17ms min=346.58µs med=4.77ms max=23.64ms p(90)=7.7ms  p(95)=9.05ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 14594.191155/s

    EXECUTION
    iteration_duration......................................................: avg=5.4ms  min=442.15µs med=4.91ms max=23.74ms p(90)=8.15ms p(95)=9.7ms 
    iterations..............................................................: 100000 14579.465895/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  3.1 MB/s
    data_sent...............................................................: 13 MB  1.9 MB/s



running (00m06.9s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m06.8s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Query test completed

=====================================================================
K6 NAOT INSERT TEST
=====================================================================

[2025-06-05 03:14:05] Running K6 NAOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 5017 complete and 0 interrupted iterations
default   [   5% ] 80 VUs  00m01.0s/10m0s  005017/100000 shared iters

running (00m02.0s), 80/80 VUs, 14770 complete and 0 interrupted iterations
default   [  15% ] 80 VUs  00m02.0s/10m0s  014770/100000 shared iters

running (00m03.0s), 80/80 VUs, 24534 complete and 0 interrupted iterations
default   [  25% ] 80 VUs  00m03.0s/10m0s  024534/100000 shared iters

running (00m04.0s), 80/80 VUs, 34561 complete and 0 interrupted iterations
default   [  35% ] 80 VUs  00m04.0s/10m0s  034561/100000 shared iters

running (00m05.0s), 80/80 VUs, 46213 complete and 0 interrupted iterations
default   [  46% ] 80 VUs  00m05.0s/10m0s  046213/100000 shared iters

running (00m06.0s), 80/80 VUs, 59356 complete and 0 interrupted iterations
default   [  59% ] 80 VUs  00m06.0s/10m0s  059356/100000 shared iters

running (00m07.0s), 80/80 VUs, 72906 complete and 0 interrupted iterations
default   [  73% ] 80 VUs  00m07.0s/10m0s  072906/100000 shared iters

running (00m08.0s), 80/80 VUs, 86724 complete and 0 interrupted iterations
default   [  87% ] 80 VUs  00m08.0s/10m0s  086725/100000 shared iters
time="2025-06-05T03:14:14Z" level=info msg="INFO: Insert test finished." source=console

running (00m09.0s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m09.0s/10m0s  100000/100000 shared iters
time="2025-06-05T03:14:14Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=12.01ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  11107.008897/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=6.93ms min=432.67µs med=6.04ms max=460.89ms p(90)=9.97ms p(95)=12.01ms
      { endpoint:postgres_insert }..............................................: avg=6.93ms min=432.67µs med=6.04ms max=460.89ms p(90)=9.97ms p(95)=12.01ms
      { expected_response:true }................................................: avg=6.93ms min=432.67µs med=6.04ms max=460.89ms p(90)=9.97ms p(95)=12.01ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 11107.119967/s

    EXECUTION
    iteration_duration..........................................................: avg=7.14ms min=516.18µs med=6.19ms max=461.45ms p(90)=10.4ms p(95)=12.56ms
    iterations..................................................................: 100000 11107.008897/s
    vus.........................................................................: 0      min=0           max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 1.0 MB/s
    data_sent...................................................................: 26 MB  2.9 MB/s



running (00m09.0s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m09.0s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Insert test completed

=====================================================================
K6 NAOT QUERY TEST
=====================================================================

[2025-06-05 03:14:14] Running K6 NAOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-05T03:14:14Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-05T03:14:14Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-05T03:14:14Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-05T03:14:14Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-05T03:14:14Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-05T03:14:14Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-05T03:14:14Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-05T03:14:14Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-05T03:14:14Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-05T03:14:14Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-05T03:14:14Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-05T03:14:14Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 11053 complete and 0 interrupted iterations
default   [  11% ] 80 VUs  00m00.9s/10m0s  011053/100000 shared iters

running (00m02.0s), 80/80 VUs, 24515 complete and 0 interrupted iterations
default   [  25% ] 80 VUs  00m01.9s/10m0s  024515/100000 shared iters

running (00m03.0s), 80/80 VUs, 38811 complete and 0 interrupted iterations
default   [  39% ] 80 VUs  00m02.9s/10m0s  038813/100000 shared iters

running (00m04.0s), 80/80 VUs, 53223 complete and 0 interrupted iterations
default   [  53% ] 80 VUs  00m03.9s/10m0s  053224/100000 shared iters

running (00m05.0s), 80/80 VUs, 67733 complete and 0 interrupted iterations
default   [  68% ] 80 VUs  00m04.9s/10m0s  067733/100000 shared iters

running (00m06.0s), 80/80 VUs, 82298 complete and 0 interrupted iterations
default   [  82% ] 80 VUs  00m05.9s/10m0s  082298/100000 shared iters

running (00m07.0s), 80/80 VUs, 96375 complete and 0 interrupted iterations
default   [  96% ] 80 VUs  00m06.9s/10m0s  096375/100000 shared iters
time="2025-06-05T03:14:21Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-05T03:14:21Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=9.78ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  41308.18103/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=5.48ms min=360.08µs med=5.02ms max=59.23ms p(90)=8.22ms p(95)=9.78ms 
      { endpoint:postgres_get }.............................................: avg=5.48ms min=360.08µs med=5.02ms max=59.23ms p(90)=8.22ms p(95)=9.78ms 
      { expected_response:true }............................................: avg=5.48ms min=360.08µs med=5.02ms max=59.23ms p(90)=8.22ms p(95)=9.78ms 
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 13783.300764/s

    EXECUTION
    iteration_duration......................................................: avg=5.73ms min=447.5µs  med=5.17ms max=62.33ms p(90)=8.72ms p(95)=10.53ms
    iterations..............................................................: 100000 13769.393677/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  2.9 MB/s
    data_sent...............................................................: 13 MB  1.8 MB/s



running (00m07.3s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m07.2s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Query test completed
[SUCCESS] All available K6 benchmarks completed
[2025-06-05 03:14:22] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed

=====================================================================
BENCHMARK COMPLETION
=====================================================================
End Time: Thu Jun  5 03:14:22 UTC 2025
Duration: 13 minutes and 4 seconds
Results saved to: sysbench_results_c6g.2xlarge_20250605_030118.txt
=====================================================================
[2025-06-05 03:14:22] ================================================
[SUCCESS] All benchmarks completed successfully!
[2025-06-05 03:14:22] Detailed results saved to: sysbench_results_c6g.2xlarge_20250605_030118.txt